# tap "github/gh"
# tap "homebrew/bundle"
# tap "nektos/tap"

# package management for appstore
brew "mas" # install mac applications on terminal

# basic tools
brew "curl" # http client
brew "git" # a ditributed version controll system
brew "nkf" # network kanji filter. convert kanji format.
brew "zsh" # shell what I use mainly
brew "ripgrep" # alternative of grep command
brew "termshark" # Wireshark in Terminal
brew "ctop" # top command for containers
brew "github/gh/gh" # github client
brew "ghq"
brew "nektos/tap/act" # run github actions locally
brew "bat" # alternative of cat command
brew "navi" # cheatsheet viewer
brew "tealdeer" # tldr manual reader
brew "xsv" # csv processor
brew "wfxr/csview" # CSV viewer
brew "bandwhich" # show network utilization
brew "gping" # graphical ping
brew "xh" # http client like httpie
brew "dog" # dns client
brew "hexyl" # hex viewer
brew "bingrep" # grep through binaries
brew "tokei" # display statistics for codes in a repository
brew "grex" # text convert into single regexp
brew "silicon" # source code into image
brew "angle-grinder" # log analyze
brew "ast-grep" # grep through abstract syntax tree
brew "clang-format" # code formatter for C++
brew "ccache" # C/C++ compiler cache
brew "cmake" # build system
brew "coreutils" # GNU core utilities
brew "ffmpeg" # video converter
brew "jq" # json processor
brew "uv" # python package manager

# modern alternatives
brew "eza" # alternative of ls command (successor of exa)
brew "fd" # alternative of find command
brew "dust" # alternative of du command
brew "duf" # alternative of df command
brew "bottom" # alternative of top command
brew "procs" # alternative of ps command

# ------------ brew cask
# cask "ueli"
cask "docker"
cask "visual-studio-code"
cask "discord"
cask "alt-tab"
cask "figma"
cask "obsidian"
cask "blender"
cask "font-cica"
cask "google-japanese-ime"
cask "obs"
cask "orbstack"
cask "steam"
cask "syncthing"
cask "ghostty"

# ------------ mas
mas "Magnet", id: 441258766 # Magnet
mas "The Unarchiver", id: 425424353 # The Unarchiver
mas "WinArchiver Lite", id: 414855915 # WinArchiver Lite
mas "LINE", id: 539883307 # LINE
mas "Slack", id: 803453959 # Slack
mas "Kindle", id: 405399194 # Kindle
mas "GoodNotes", id: 1444383602 # GoodNotes
