{
  "catppuccin": { "branch": "main" },
  "clever-f.vim": { "branch": "master" },
  "dial.nvim": { "branch": "master" },
  "im-select.nvim": { "branch": "master" },
  "lasterisk.nvim": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "nvim-hlslens": { "branch": "main" },
  "nvim-surround": { "branch": "main" },
  "quick-scope": { "branch": "master" },
  "substitute.nvim": { "branch": "main" },
  "targets.vim": { "branch": "master" },
  "vim-edgemotion": { "branch": "master" },
  "vim-metarepeat": { "branch": "master" }
}
